Repository: rogergaitan/granadatiles
Catalog: granadatiles_project/templates/locale/*/LC_MESSAGES/django.po
Languages: es

source: LIVE CHAT
es: CHAT EN VIVO

source: MY PORTFOLIO
es: MI PORTAFOLIO

source: CART
es: CARRITO

source: COLLECTIONS
es: COLECCIONES

source: GALLERY
es: GALERÍA

source: IN STOCK
es: EN EXISTENCIA

source: RESIDENTIAL
es: RESIDENCIAL

source: COMMERCIAL
es: COMERCIAL

source: NEWS/PRESS
es: NOTICIAS/PRENSA

source: ABOUT US
es: ACERCA DE

source: BROWSE OUR CEMENT TILE COLLECTIONS
es: EXPLORA NUESTRAS COLECCIONES DE AZULEJOS

source: In Stock Samples
es: Muestras en existencia

source: PRODUCT INFORMATION
es: INFORMACION DE PRODUCTO

source: In Stock Tiles
es: Azulejos en existencia

source: Compare our Products
es: Compare nuestros productos

source: Cement Vs. Ceramic
es: Cemento Vs. Cerámica

source: Color Palletes
es: Paleta de colores

source: Catalogs / Inspiration Boooks
es: Catalogos / Libros Inspiracionales

source: Designer
es: Diseñador

source: Photographer
es: Fotógrafo

source: Also Featured in
es: Tambien aparece en

source: About us
es: Acerca de

source: Compare our products
es: Compare nuestros productos

source: Collections
es: Colecciones

source: Magazines
es: Revistas

source: Catalogs / Inspiration Books
es: Catalogos / Libros inspiracionales

source: Cement Tile Blog
es: Blog de Azulejos de cemento

source: Gallery
es: Galleria

source: Cement tile is not just a tile made with cement. Cement tile has the strength of concrete & the feel of silk
es: Un azulejo de cemento no es solamente un azulejo hecho con cemento. Un azulejo de cemento tiene la fuerza del concreto y la sensación de la seda

source: Explore our collections
es: Explora nuestras colecciones

source: View collection
es: Ver coleccion

source: Get inspired by Residential and Commercial installation photos
es: Inspírate en las fotos de instalaciones Residenciales y Comerciales

source: then choose from in stock and custom tiles.
es: a continuación, elege entre azulejos en existencia y personalizados.

source: Read what our architect, designer, and homeowner clients say
es: Lea lo que dicen nuestros clientes arquitectos, diseñadores y dueños de casa

source: News
es: Noticias

source: Date
es: Fecha

source: Catalogs / Inspirations Books
es: Catalogos / Libros inspiracionales

source: View
es: Ver

source: Download
es: Descargar

source: Share
es: Compartir

source: Interactive Catalog
es: Catalogo Interactivo

source: Custom Cement Tiles
es: Azulejos Personalizados

source: About the
es: Acerca de

source: Applications of Cement Tile
es: Aplicaciones de azulejos de cemento

source: Gallery
es: Galeria

source: Technical Specifications
es: Especificaciones técnicas

source: Ordering Cement Tile
es: Pedido de azulejos

source: Installing Cement Tile
es: Instalando los azulejos

source: Tiles
es: Azulejos
